In [1]:
import pandas as pd

In [2]:
# 2 main data types (series which is 1D and dataframe which is 2D)

series = pd.Series(["BMW", "Volkswagen", "Porsche"])

In [3]:
series

0           BMW
1    Volkswagen
2       Porsche
dtype: object

In [6]:
colors = pd.Series(["Red", "Yellow", "Blue"])
colors

0       Red
1    Yellow
2      Blue
dtype: object

In [7]:
car_data = pd.DataFrame({"Car Make": series, "Color": colors})
car_data

     Car Make   Color
0         BMW     Red
1  Volkswagen  Yellow
2     Porsche    Blue

In [13]:
#Import data into dataframe
external = pd.read_csv("car-sales.csv")
car_data = pd.DataFrame(external)

In [14]:
car_data

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [15]:
#x-axis = 0
#y-axis = 1

In [24]:
#Export data
#Adding index = False stops the auto index column from veing exported
car_data.to_csv("exported-car-sales.csv", index=False)

In [25]:
export_car_sales = pd.read_csv("exported-car-sales.csv")

In [26]:
export_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00